# King County House Sales Project

Please fill out:
* Student name: GORRETI MUTHONI
* Student pace: FULL TIME

## Business Understanding

A real estate agency has given us a task to analyze house prices based on various features of the house. They want to know what kind of advice to give to homeowners when they want to buy or sell homes. In this project, I will use Linear Regression Modelling to predict the sale price of the homes in the King County House dataset so as to know what features of a house will increase the sale price of the houses. The insights from this project will be used to give advice to homeowners who want to buy or sell homes.

## Data Understanding
For this project I will use the ```kc_house_data.csv``` data to predict the sales of houses. The following is the information on the columns in the dataset;

* `id` - Unique identifier for a house
* `date` - Date house was sold
* `price` - Sale price (prediction target)
* `bedrooms` - Number of bedrooms
* `bathrooms` - Number of bathrooms
* `sqft_living` - Square footage of living space in the home
* `sqft_lot` - Square footage of the lot
* `floors` - Number of floors (levels) in house
* `waterfront` - Whether the house is on a waterfront
* `view` - Quality of view from house
* `condition` - How good the overall condition of the house is. Related to maintenance of house.
* `grade` - Overall grade of the house. Related to the construction and design of the house.
* `sqft_above` - Square footage of house apart from basement
* `sqft_basement` - Square footage of the basement
* `yr_built` - Year when house was built
* `yr_renovated` - Year when house was renovated
* `zipcode` - ZIP Code used by the United States Postal Service
* `lat` - Latitude coordinate
* `long` - Longitude coordinate
* `sqft_living15` - The square footage of interior housing living space for the nearest 15 neighbors
* `sqft_lot15` - The square footage of the land lots of the nearest 15 neighbors

### Importing Libraries

In [1]:
# for loading and manipulation of data
import pandas as pd

# for visualization
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
sns.set_style("darkgrid")

# for linear regression modelling
import scipy.stats as stats
import statsmodels.api as sm
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_absolute_error

### Loading Dataset

In [2]:
data = pd.read_csv("kc_house_data.csv")

### Data Understanding

In [3]:
# preview of the first 5 rows
data.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,10/13/2014,221900.0,3,1.00,1180,5650,1.0,NaN,NONE,...,7 Average,1180,0.0,1955,0.0,98178,47.5112,-122.257,1340,5650
1,6414100192,12/9/2014,538000.0,3,2.25,2570,7242,2.0,NO,NONE,...,7 Average,2170,400.0,1951,1991.0,98125,47.7210,-122.319,1690,7639
2,5631500400,2/25/2015,180000.0,2,1.00,770,10000,1.0,NO,NONE,...,6 Low Average,770,0.0,1933,NaN,98028,47.7379,-122.233,2720,8062
3,2487200875,12/9/2014,604000.0,4,3.00,1960,5000,1.0,NO,NONE,...,7 Average,1050,910.0,1965,0.0,98136,47.5208,-122.393,1360,5000
4,1954400510,2/18/2015,510000.0,3,2.00,1680,8080,1.0,NO,NONE,...,8 Good,1680,0.0,1987,0.0,98074,47.6168,-122.045,1800,7503

In [4]:
# preview of the last 5 rows
data.tail()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
21592,263000018,5/21/2014,360000.0,3,2.50,1530,1131,3.0,NO,NONE,...,8 Good,1530,0.0,2009,0.0,98103,47.6993,-122.346,1530,1509
21593,6600060120,2/23/2015,400000.0,4,2.50,2310,5813,2.0,NO,NONE,...,8 Good,2310,0.0,2014,0.0,98146,47.5107,-122.362,1830,7200
21594,1523300141,6/23/2014,402101.0,2,0.75,1020,1350,2.0,NO,NONE,...,7 Average,1020,0.0,2009,0.0,98144,47.5944,-122.299,1020,2007
21595,291310100,1/16/2015,400000.0,3,2.50,1600,2388,2.0,NaN,NONE,...,8 Good,1600,0.0,2004,0.0,98027,47.5345,-122.069,1410,1287
21596,1523300157,10/15/2014,325000.0,2,0.75,1020,1076,2.0,NO,NONE,...,7 Average,1020,0.0,2008,0.0,98144,47.5941,-122.299,1020,1357

In [5]:
# number of rows and columns
data.shape

(21597, 21)

In [6]:
# statistical summary of data
data.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,sqft_above,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
count,2.159700e+04,2.159700e+04,21597.000000,21597.000000,21597.000000,2.159700e+04,21597.000000,21597.000000,21597.000000,17755.000000,21597.000000,21597.000000,21597.000000,21597.000000,21597.000000
mean,4.580474e+09,5.402966e+05,3.373200,2.115826,2080.321850,1.509941e+04,1.494096,1788.596842,1970.999676,83.636778,98077.951845,47.560093,-122.213982,1986.620318,12758.283512
std,2.876736e+09,3.673681e+05,0.926299,0.768984,918.106125,4.141264e+04,0.539683,827.759761,29.375234,399.946414,53.513072,0.138552,0.140724,685.230472,27274.441950
min,1.000102e+06,7.800000e+04,1.000000,0.500000,370.000000,5.200000e+02,1.000000,370.000000,1900.000000,0.000000,98001.000000,47.155900,-122.519000,399.000000,651.000000
25%,2.123049e+09,3.220000e+05,3.000000,1.750000,1430.000000,5.040000e+03,1.000000,1190.000000,1951.000000,0.000000,98033.000000,47.471100,-122.328000,1490.000000,5100.000000
50%,3.904930e+09,4.500000e+05,3.000000,2.250000,1910.000000,7.618000e+03,1.500000,1560.000000,1975.000000,0.000000,98065.000000,47.571800,-122.231000,1840.000000,7620.000000
75%,7.308900e+09,6.450000e+05,4.000000,2.500000,2550.000000,1.068500e+04,2.000000,2210.000000,1997.000000,0.000000,98118.000000,47.678000,-122.125000,2360.000000,10083.000000
max,9.900000e+09,7.700000e+06,33.000000,8.000000,13540.000000,1.651359e+06,3.500000,9410.000000,2015.000000,2015.000000,98199.000000,47.777600,-121.315000,6210.000000,871200.000000

In [7]:
# Information on the columns
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21597 entries, 0 to 21596
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21597 non-null  int64
 1   date           21597 non-null  object
 2   price          21597 non-null  float64
 3   bedrooms       21597 non-null  int64
 4   bathrooms      21597 non-null  float64
 5   sqft_living    21597 non-null  int64
 6   sqft_lot       21597 non-null  int64
 7   floors         21597 non-null  float64
 8   waterfront     19221 non-null  object
 9   view           21534 non-null  object
 10  condition      21597 non-null  object
 11  grade          21597 non-null  object
 12  sqft_above     21597 non-null  int64
 13  sqft_basement  21597 non-null  object
 14  yr_built       21597 non-null  int64
 15  yr_renovated   17755 non-null  float64
 16  zipcode        21597 non-null  int64
 17  lat            21597 non-null  float64
 18  long           21597 non-null  float64
 19  sqft_living15  21597 non-null  int64
 20  sqft_lot15     21597 non-null  int64
dtypes: float64(6), int64(9), object(6)
memory usage: 3.5+ MB

From above, this dataset consists of the following;
* There are 21597 rows and 21 columns
* There are 9 columns of type ```int64```, 6 columns of type ```string``` and 6 columns of type ```float64```.
* The following columns have null values;
    * waterfront
    * view
    * yr_renovated

### Data Cleaning

Our dataset has a total of 21 columns. For this project, I will not be using all the columns. The following are the columns I will not be using;

         date
         view
         sqft_above
         sqft_basement
         yr_renovated
         zipcode
         lat
         long
         sqft_living15
         sqft_lot15

In [8]:
# dropping columns that i'll not be using
data = data.drop(data[["date", "view", "sqft_above", "sqft_basement", "yr_renovated", "zipcode", "lat", "long",
"sqft_living15", "sqft_lot15"]], axis = 1)
data.head()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,condition,grade,yr_built
0,7129300520,221900.0,3,1.00,1180,5650,1.0,NaN,Average,7 Average,1955
1,6414100192,538000.0,3,2.25,2570,7242,2.0,NO,Average,7 Average,1951
2,5631500400,180000.0,2,1.00,770,10000,1.0,NO,Average,6 Low Average,1933
3,2487200875,604000.0,4,3.00,1960,5000,1.0,NO,Very Good,7 Average,1965
4,1954400510,510000.0,3,2.00,1680,8080,1.0,NO,Average,8 Good,1987

In [9]:
# information on new data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21597 entries, 0 to 21596
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           21597 non-null  int64
 1   price        21597 non-null  float64
 2   bedrooms     21597 non-null  int64
 3   bathrooms    21597 non-null  float64
 4   sqft_living  21597 non-null  int64
 5   sqft_lot     21597 non-null  int64
 6   floors       21597 non-null  float64
 7   waterfront   19221 non-null  object
 8   condition    21597 non-null  object
 9   grade        21597 non-null  object
 10  yr_built     21597 non-null  int64
dtypes: float64(3), int64(5), object(3)
memory usage: 1.8+ MB

Our new dataset now has a total of 11 columns. 3 columns are of type ```float64```, 5 columns of type ```int64``` and 3 columns of type ```string```.

The column ```waterfront``` has null values because it has a non-null count of ```19221``` instead of ```21597```.

In [10]:
# number of rows with null values
data.isna().sum()

id                0
price             0
bedrooms          0
bathrooms         0
sqft_living       0
sqft_lot          0
floors            0
waterfront     2376
condition         0
grade             0
yr_built          0
dtype: int64

The waterfront column has a total of 2376 rows which have null values.

In [11]:
# sample rows where waterfront has no missing values
data[data["waterfront"].notna()].sample(5, random_state = 1)

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,condition,grade,yr_built
1551,984220240,299000.0,4,2.50,1820,7575,1.0,NO,Average,7 Average,1975
9501,1402000210,390000.0,3,2.25,2420,31497,1.0,NO,Good,8 Good,1964
12974,6632300477,324950.0,3,1.00,1040,7288,1.0,NO,Average,7 Average,1959
14409,8137500730,500000.0,3,2.50,1940,37565,1.0,NO,Good,8 Good,1987
8630,259000100,430000.0,3,1.75,1610,7900,1.0,NO,Good,8 Good,1960

In [12]:
# sample rows where waterfront has missing values
data[data["waterfront"].isna()].sample(5, random_state = 1)

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,condition,grade,yr_built
16195,4450700010,375000.0,3,1.75,1660,9673,1.0,NaN,Average,7 Average,1976
2510,2126079046,390000.0,3,1.75,1220,216332,1.0,NaN,Average,7 Average,1981
10389,1072000260,399000.0,3,1.75,1780,11440,1.0,NaN,Average,8 Good,1977
14597,2423069170,770000.0,3,2.50,2430,54059,2.0,NaN,Average,10 Very Good,1987
2638,4045800030,739000.0,3,2.25,2220,10530,1.0,NaN,Good,8 Good,1974

In [13]:
# drop rows with missing values
data.dropna(subset = ["waterfront"], inplace = True)

In [14]:
# confirming there are no null values
data.isna().sum()

id             0
price          0
bedrooms       0
bathrooms      0
sqft_living    0
sqft_lot       0
floors         0
waterfront     0
condition      0
grade          0
yr_built       0
dtype: int64

In [15]:
# information on data
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19221 entries, 1 to 21596
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           19221 non-null  int64
 1   price        19221 non-null  float64
 2   bedrooms     19221 non-null  int64
 3   bathrooms    19221 non-null  float64
 4   sqft_living  19221 non-null  int64
 5   sqft_lot     19221 non-null  int64
 6   floors       19221 non-null  float64
 7   waterfront   19221 non-null  object
 8   condition    19221 non-null  object
 9   grade        19221 non-null  object
 10  yr_built     19221 non-null  int64
dtypes: float64(3), int64(5), object(3)
memory usage: 1.8+ MB